<?php

return [
    'invalid_order' => 'هذا الطلب غير موجود ',
    'invalid_invoice' => 'هذه الفاتورة غير موجوده ',
    'in_review' => 'هذا الطلب تحت المراجعه يرجي الانتظار',
    'order_in_review' => 'هذا الطلب تحت المراجعه يرجي الانتظار حتي يتم تأكيد الطلب',
    'invalid_payment_method'    => 'طريقة الدفع غير موجوده ',
    'order_has_transactions'    => "لا يمكنك حذف هذا الطلب لانه مرتبط بعمليات دفع",

    'orders'    => [
        'in_review' => 'طلبك قيد المراجعه يرجي الانتظار',
        'deleted' => 'لقد تم حذف هذا الطلب .',
        'cancelled' => 'لقد تم الغاء هذا الطلب .',
        'cancelled_before' => 'لقد تم الغاء هذا الطلب من قبل .',
        'paid_before' => 'لقد تم دفع هذا الطلب من قبل .',
        'validations'   => [
            'availability'  => [
                'not_available' => 'الدكتور غير متاح في هذا الموعد، من فضلك قم ب اختيار وقت اخر.',
            ],
            'celebrity'     => [
                'not_available' => 'نعتذر ، هذا المشهور مشغول غير قادر علي استقبال الطلبات حاليا',
            ],
            'celebrity_id'  => [
                'required'  => 'من فضلك اختر المشهور',
            ],
            'date'          => [
                'required'  => 'من فضلك اختر التاريخ',
            ],
            'doctor_id'     => [
                'required'  => 'اختر الدكتور',
            ],
            'email'         => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'instructions'  => [
                'required'  => 'من فضلك ادخل التعليمات',
            ],
            'max'           => [
                'required'  => 'الحد الأقصى لحجم الملف المسموح به لمقاطع الفيديو 10 ميجا بايت',
            ],
            'mimes'         => [
                'required'  => 'من فضلك اختر نوع الفيديو MP4',
            ],
            'mobile'        => [
                'required'  => 'من فضلك ادخل رقم الهاتف',
            ],
            'name'          => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'occasion_id'   => [
                'required'  => 'من فضلك ادخل المناسبه',
            ],
            'service_id'    => [
                'required'  => 'اختر الخدمة',
            ],
            'time_from'     => [
                'required'  => 'من فضلك اختر موعد البداية',
            ],
            'time_to'       => [
                'required'  => 'من فضلك اختر موعد النهاية',
            ],
            'to'            => [
                'required'  => 'من فضلك اختر اسم الشخص المرسل له الفيديو',
            ],
            'video'         => [
                'required'  => 'من فضلك قم برفع الفيديو المطلوب',
            ],
            'worker_id'     => [
                'required'  => 'اختر العامل',
            ],
        ],

    ],
    'order_statuses'    => [
        'status'    => [
            'success'   => 'تم الدفع',
            'failed'    => 'فشل الدفع',
            'pending'   => 'جاري الدفع',
            'in-complete'   => 'جاري المعالجه',
            'in_review'   => 'تحت المراجعه',
        ],
        'payments'  => [
            'moyasar'   => 'ميسر',
            'upayment'  => 'يو بايمنت',
            'wallet'    => 'المحفظة الالكترونية',
            'myfatoorah' => 'ماي فاتورة',
        ],
    ],
];
